print("Hello World");

# 한줄 주석
'''
여러줄 주석
.........
........
'''

'''
주석(Command)
- 주석은 코드에 설명을 작성해 놓은 부분으로 타인이 소스코드를 봤을 때 이해하기 쉽게 도와주는 기능임
- 프로그램 실행 시 무시됨!!
- 주석은 복잡한 코드를 이해하기 쉽게 하며 개발자들이 코드를 공유하거나 유지 보수할 때 유용하게 사용된다 
'''

'''
실행문
- 프로그램이 실제로 동작하면서 각종 작업을 수행하는 코드를 의미한다 
- 변수선언, 메소드 호출 및 선언 연산자, 조건문, 반복문 등과 같은 여러 가지 요소를 조합하여 원하는 
실행문을 만들 수 있다. 
'''
print("Hello Python"); # Hello Python 이라는 구문을 출력하라 !! 라는 뜻 
print("*") # 18 ~ 21 번째 라인처럼 c, c++, java 처럼 문장 뒤에 세미콜론을 생략해도 별다른 오류가 발생하지 않는다 
print("**")
print("***")
print("****")
print("*****"); print("******") # 단) 한 라인에 두가지 이상의 실행문을 작성한다면 세미콜론을 붙혀야 한다
# 세미콜론(;) : 프로그래밍 세계에서 문장의 끝을 나타내는 기호